/*আমাদের ৩ টা দরজা দেওয়া আছে।৩টা দরজার মধ্যে ২ টা দরজার চাবি পিছনে আছে। প্রথম ডিজিটে  একটা দরজার নাম্বার বলা হবে যেটা খুললে অই দরজার পিছনে আরেকটা ডিজিট পাব যেটা দিয়ে আরেকটা দরজা খুলব।
4 test case
3
0 1 2 yes
1
0 3 2 no
2
3 1 0 yes
2
1 3 0 no*/
#include<stdio.h>
int main()
{
    int a[5],b,i,k;
    scanf("%d",&b);
    while(b--)
    {
        scanf("%d",&k);
        for(i=1;i<=3;i++)
        {
            scanf("%d",&a[i]);
        }
        if(a[k]!=0 && a[a[k]]!=0 )
        {
             printf("YES\n");
        }

        else
        {printf("NO\n");
    }

}
}
